---
kind: method
id: M:Autodesk.Revit.DB.FailureMessageAccessor.GetSeverity
source: html/4fd77545-91d7-3ef4-20ca-2f78b917a319.htm
---
# Autodesk.Revit.DB.FailureMessageAccessor.GetSeverity Method

Retrieves the severity of the failure.

## Syntax (C#)
```csharp
public FailureSeverity GetSeverity()
```

## Returns
The severity of the failure.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - This FailureMessageAccessor has not been properly initialized.